Repository: pypi-data/pypi-mirror-132
Catalog: packages/zopyx.usersascontent/zopyx.usersascontent-1.0a1.tar.gz/zopyx.usersascontent-1.0a1/src/zopyx/usersascontent/locales/*/LC_MESSAGES/zopyx.usersascontent.po
Languages: de

source: Backward references
de: Rückreferenzen

source: Email address
de: E-Mail Addresse

source: First login
de: Erster Login

source: Forward references
de: Vorwärtsreferenzen

source: ID of user folder
de: ID des Benutzerordners

source: Information about yourself
de: Persönliche Informationen

source: Last login
de: Letzer Login

source: My Dashboard
de: Meine Profilseite

source: My content
de: Meine Inhalte

source: Organization
de: Organisation

source: Personal information
de: Persönliche Information

source: Redirect to user object after registration (first login)
de: Weiterleitung auf Benutzerobject nach Registrierung

source: Redirect to user object always after login
de: Immer nach dem Login auf Benutzerobjekt weiterleiten

source: Users as Content
de: Benutzer als Inhalte

source: Users as Content settings
de: Benutzer als Inhalte

source: Your fullname
de: Voller Name

source: Your picture
de: Ihr Bild
